ws-asahi/UkiUkiCore/megaavr/variants/UkiUkiduino/pins_arduino.h
/* pins_arduino.h - Variant definition for the UkiUkiduino (AVR64DU32)
 * ---------------------------------------------------------------------------
 * Part of UkiUkiCore (a product-specific fork of WazamonoCore / SpenceKonde's
 * DxCore). DxCore is (C) Spence Konde 2021-2022, open source (LGPL 2.1, see
 * LICENSE.md), based on existing Arduino cores. This variant (C) Workshop
 * Asahi 2026.
 *
 * Board   : UkiUkiduino (Arduino Uno R3 form factor, AVR64DU32-I/PT, USB-C)
 * MCU     : AVR64DU32  (32-pin TQFP)
 * Clock   : CRYSTAL-LESS. Internal OSCHF fixed at 24 MHz (boards.txt sets
 *           build.clocksource=0, no Clock menu). PA0/PA1 are therefore plain
 *           GPIO on this board and are mapped to D7 / D20.
 *           USB CLK_USB (48 MHz) is produced by OSCHF + PLL48M and is
 *           auto-tuned to the USB SOF, independently of the system clock.
 *
 *  ===== Pin numbering: Arduino Uno R3 compatible (NONCANONICAL) =====
 *   D#   MCU   Uno R3 role / notes                          A#,  AIN
 *   D0   PA5   RX  (Serial0 / USART0 RX, ALT1)              A6,  AIN25
 *   D1   PA4   TX  (Serial0 / USART0 TX, ALT1)              A7,  AIN24
 *   D2   PA6   (USART0 XCK, ALT1)                           A8,  AIN26
 *   D3   PF5   ~PWM(TCB1, ALT1)                             A9,  AIN21
 *   D4   PF4   (general I/O; no PWM - TCB0 is millis)       A10, AIN20
 *   D5   PD0   ~PWM(TCA0 WO0) | CCL                         A11, AIN0
 *   D6   PD1   ~PWM(TCA0 WO1) | CCL                         A12, AIN1
 *   D7   PA0   (general I/O; NO ADC channel - A13 is not assigned)
 *   D8   PA7   (general I/O, native 5V)                     A14, AIN27
 *   D9   PD2   ~PWM(TCA0 WO2) | CCL | AC0 AINP0 | EVOUTD    A15, AIN2
 *   D10  PD3   ~PWM(TCA0 WO3) | CCL | AC0 AINN0 | (SS)      A16, AIN3
 *   D11  PD4   ~PWM(TCA0 WO4) | SPI MOSI                    A17, AIN4
 *   D12  PD5   ~PWM(TCA0 WO5) | SPI MISO                    A18, AIN5
 *   D13  PD6   SPI SCK | LED_BUILTIN (mirrored onto PC3)    A19, AIN6
 *   D14  PF0   A0 | CCL                                     A0,  AIN16
 *   D15  PF1   A1 | CCL                                     A1,  AIN17
 *   D16  PF2   A2 | CCL | EVOUTF                            A2,  AIN18
 *   D17  PF3   A3 | CCL                                     A3,  AIN19
 *   D18  PA2   A4 | SDA (I2C)                               A4,  AIN22
 *   D19  PA3   A5 | SCL (I2C)                               A5,  AIN23
 *   D20  PA1   BTN_BUILTIN (on-board button, external 1k pull-down,
 *              pressed = HIGH; no header pin)
 *   --- not exposed as a numbered Dn (appended so the arrays are complete) ---
 *        PC3   BUILTIN_LED driver (CCL LUT1 mirror of PD6)  index 21  (VUSB domain)
 *        PD7   AREF header pin = VREFA (external analog reference; AIN7)
 *                                                           index 22
 *        PF6   RESET                                        index 23
 *        PF7   UPDI (Power header pin 1)                    index 24  (== PIN_PF7, highest)
 *
 *  ===== Peripheral routing (set by this variant + boards.txt) =====
 *   TCA0  -> PORTD (WO0..WO5 = PD0,PD1,PD2,PD3,PD4,PD5 = D5,D6,D9,D10,D11,D12)
 *   TCB1  -> ALT1 (PF5 = D3)  : ~PWM on D3 (shared with tone(), see below)
 *   millis-> TCB0 : boards.txt passes -DMILLIS_USE_TIMERB0, so TCB1 is free for D3.
 *   tone()-> TCB1 : Tone.cpp auto-selects TCB1 when millis is on TCB0. tone() and
 *           D3 PWM share TCB1, so calling tone() suspends D3 PWM only; D11 PWM
 *           (TCA0) and millis (TCB0) keep running (cf. Uno R3 Timer2 = D3+D11).
 *   SPI0  -> ALT4 (PD4 MOSI / PD5 MISO / PD6 SCK = D11/D12/D13). Board is SPI host;
 *           default CS exposed as PIN_SPI_SS = PD3 (D10, Uno convention). The ALT4
 *           hardware SS is PD7 (= AREF); run SPI host with Client Select Disable
 *           (SPI0.CTRLB.SSD = 1) so the AREF level cannot flip host -> client mode.
 *   TWI0  -> default (PA2 SDA / PA3 SCL) = D18/D19 = A4/A5 (Uno I2C convention).
 *   USART0-> "Serial1" (alias of Serial0), ALT1 (PA4 TX / PA5 RX) = D1/D0.
 *           (The Uno R3 D0/D1 UART.)
 *           The DEFAULT mux position (PA0/PA1) is D7/D20 on this board; ALT1 stays
 *           the variant default so D0/D1 behave like the classic Uno UART.
 *   USART1-> exists on the AVR DU but has NO usable pin position on UkiUkiduino
 *           (DU USART1 is only PD6/PD7, which are SPI SCK / AREF here). Its
 *           Serial1 object is suppressed (HWSERIAL1_SUPPRESS) and the name
 *           "Serial1" is re-pointed at USART0 (see below).
 *   AREF  -> PD7 = VREFA is wired to the Uno R3 AREF header pin, so
 *           analogReference(EXTERNAL) IS supported on this board.
 *   LED   -> on-board LED is driven by PC3, which hardware-mirrors PD6 (D13) via
 *           EVSYS -> CCL LUT1 (see ukiukiduino_init.cpp), replacing the Uno R3
 *           op-amp buffer on pin 13. PC3 is in the VUSB domain, so the LED lights
 *           only while the USB voltage regulator is on.
 *   BUTTON-> BTN_BUILTIN = D20 (PA1). External 1 kOhm pull-down on the board;
 *           pressed = HIGH. Use pinMode(BTN_BUILTIN, INPUT) - no pullup needed.
 *   Serial-> native USB CDC (USBSerial), Leonardo/Micro convention.
 *
 *   NOTE on names: the Uno R3 D0/D1 UART is wired to USART0 on this board. The
 *   USART1 object is suppressed and "Serial1" is aliased to USART0, so users
 *   reach the D0/D1 hardware UART as "Serial1" (Uno-family convention;
 *   "Serial0" refers to the same object). "Serial" is the native USB CDC
 *   (serial monitor), so day-to-day Serial.print() behaves exactly like a
 *   classic Uno; use "Serial1" only to talk to an external device on D0/D1.
 */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

/* Informational pinout tags. DU_32PIN_PINOUT keeps DU-32 feature assumptions in
 * the core; UKIUKIDUINO_PINOUT identifies this board. NONCANONICAL_PIN_NUMBERS
 * tells the core to derive (port,bit) from the tables below instead of assuming
 * pin number == port order (our numbering does not follow port order). */
#define DU_32PIN_PINOUT
#define UKIUKIDUINO_PINOUT
#define NONCANONICAL_PIN_NUMBERS

/* ---- Digital pin number for each MCU pin (Uno R3 layout, D0..D20 contiguous) ---- */
#define PIN_PA5 (0)   // D0  RX  (USART0 RX, ALT1)
#define PIN_PA4 (1)   // D1  TX  (USART0 TX, ALT1)
#define PIN_PA6 (2)   // D2  (USART0 XCK)
#define PIN_PF5 (3)   // D3  ~PWM(TCB1, ALT1)
#define PIN_PF4 (4)   // D4  general I/O (no PWM: TCB0 = millis)
#define PIN_PD0 (5)   // D5  TCA0 WO0
#define PIN_PD1 (6)   // D6  TCA0 WO1
#define PIN_PA0 (7)   // D7  general I/O (no ADC channel; A13 not assigned)
#define PIN_PA7 (8)   // D8  general I/O (native 5V)
#define PIN_PD2 (9)   // D9  TCA0 WO2
#define PIN_PD3 (10)  // D10 TCA0 WO3 / SS (Uno convention, SSD=1)
#define PIN_PD4 (11)  // D11 TCA0 WO4 / SPI MOSI
#define PIN_PD5 (12)  // D12 TCA0 WO5 / SPI MISO
#define PIN_PD6 (13)  // D13 SPI SCK / LED_BUILTIN (mirrored to PC3 via CCL)
#define PIN_PF0 (14)  // D14 A0
#define PIN_PF1 (15)  // D15 A1
#define PIN_PF2 (16)  // D16 A2
#define PIN_PF3 (17)  // D17 A3
#define PIN_PA2 (18)  // D18 A4 / SDA
#define PIN_PA3 (19)  // D19 A5 / SCL
#define PIN_PA1 (20)  // D20 BTN_BUILTIN (on-board button; no ADC channel)
#define PIN_PC3 (21)  // BUILTIN_LED driver (CCL LUT1 mirror of PD6); VUSB domain; no Dn alias
#define PIN_PD7 (22)  // AREF header pin = VREFA (external reference; AIN7); no Dn alias
#define PIN_PF6 (23)  // RESET
#define PIN_PF7 (24)  // UPDI (Power header pin 1; highest index -> NUM_DIGITAL_PINS = 25)

/* ---- Counts ---- */
#define PINS_COUNT                     (25)  // length of the pin tables (incl. reserved)
#define NUM_ANALOG_INPUTS              (31)  // highest ADC channel in use is AIN31 (PC3)
// NUM_DIGITAL_PINS / NUM_TOTAL_PINS  -> auto = PIN_PF7 + 1 = 25
// NUM_INTERNALLY_USED_PINS           -> auto = 0 (internal clock; no crystal pins)

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                  (PIN_PD6)   // D13, on-board LED (Uno convention)
#endif
#if !defined(BTN_BUILTIN)
  #define BTN_BUILTIN                  (PIN_PA1)   // D20, on-board button (pull-down, pressed = HIGH)
#endif

#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

/* ---- Explicit maps (NONCANONICAL numbering: arithmetic shortcuts cannot be used) ----
 * PA0 (D7) and PA1 (D20) have no ADC channel on the AVR DU and are therefore
 * absent from these maps (-> NOT_A_PIN). PD7 (AREF) keeps its AIN7 mapping so
 * the pin can still be sampled when it is not used as the external reference. */
#define digitalPinToAnalogInput(p)  ( \
    (p) == PIN_PD0 ?  0 : (p) == PIN_PD1 ?  1 : (p) == PIN_PD2 ?  2 : (p) == PIN_PD3 ?  3 : \
    (p) == PIN_PD4 ?  4 : (p) == PIN_PD5 ?  5 : (p) == PIN_PD6 ?  6 : (p) == PIN_PD7 ?  7 : \
    (p) == PIN_PF0 ? 16 : (p) == PIN_PF1 ? 17 : (p) == PIN_PF2 ? 18 : (p) == PIN_PF3 ? 19 : \
    (p) == PIN_PF4 ? 20 : (p) == PIN_PF5 ? 21 : \
    (p) == PIN_PA2 ? 22 : (p) == PIN_PA3 ? 23 : (p) == PIN_PA4 ? 24 : (p) == PIN_PA5 ? 25 : \
    (p) == PIN_PA6 ? 26 : (p) == PIN_PA7 ? 27 : (p) == PIN_PC3 ? 31 : NOT_A_PIN )

#define analogChannelToDigitalPin(p)  ( \
    (p) ==  0 ? PIN_PD0 : (p) ==  1 ? PIN_PD1 : (p) ==  2 ? PIN_PD2 : (p) ==  3 ? PIN_PD3 : \
    (p) ==  4 ? PIN_PD4 : (p) ==  5 ? PIN_PD5 : (p) ==  6 ? PIN_PD6 : (p) ==  7 ? PIN_PD7 : \
    (p) == 16 ? PIN_PF0 : (p) == 17 ? PIN_PF1 : (p) == 18 ? PIN_PF2 : (p) == 19 ? PIN_PF3 : \
    (p) == 20 ? PIN_PF4 : (p) == 21 ? PIN_PF5 : \
    (p) == 22 ? PIN_PA2 : (p) == 23 ? PIN_PA3 : (p) == 24 ? PIN_PA4 : (p) == 25 ? PIN_PA5 : \
    (p) == 26 ? PIN_PA6 : (p) == 27 ? PIN_PA7 : (p) == 31 ? PIN_PC3 : NOT_A_PIN )

